#***CH_01 ~ CH_02 배운 내용 복습 (Titanic 직접 해보기)***

In [ ]:
import pandas as pd
titanic_df = pd.read_csv('train.csv')
titanic_df.head(3)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S

[3 rows x 12 columns]

In [ ]:
titanic_df.shape

(891, 12)

In [ ]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

**NAN(결측치)값 대체하기**

In [ ]:
titanic_df['Age'].fillna(titanic_df['Age'].mean(),inplace = True)
titanic_df['Cabin'].fillna('N',inplace = True)
titanic_df['Embarked'].fillna('N',inplace = True)

**NAME(이름) 전처리**

In [ ]:
titanic_df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [ ]:
titanic_df['pre_Name'] = titanic_df['Name'].str.extract(' ([A-Za-z]+)\.') # 정규 표현식 ([A-Za-z]+)\. 사용

In [ ]:
titanic_df['pre_Name']

0        Mr
1       Mrs
2      Miss
3       Mrs
4        Mr
       ...
886     Rev
887    Miss
888    Miss
889      Mr
890      Mr
Name: pre_Name, Length: 891, dtype: object

**AGE(나이) 전처리**

In [ ]:
titanic_df['Age'].value_counts()

29.699118    177
24.000000     30
22.000000     27
18.000000     26
28.000000     25
            ...
55.500000      1
53.000000      1
20.500000      1
23.500000      1
0.420000       1
Name: Age, Length: 89, dtype: int64

In [ ]:
def cat_age(age):
  cat = ""
  if age <= -1: cat = 'unKnown' #np.nan
  if age <= 5: cat = "Baby"
  elif age <= 12: cat = "Child"
  elif age <= 18: cat = "Teenager"
  elif age <= 25: cat = "Student"
  elif age <= 35: cat = "YoungAdult"
  elif age <= 60: cat = "Adult"
  else: cat = "Elderly"

  return cat

titanic_df['Cat_age'] = titanic_df['Age'].apply(lambda x: cat_age(x))
# titanic_df['Cat_age'].fillna(titanic_df['Cat_age'].mode(),inplace = True)

In [ ]:
titanic_df['Cat_age']

0         Student
1           Adult
2      YoungAdult
3      YoungAdult
4      YoungAdult
          ...
886    YoungAdult
887       Student
888    YoungAdult
889    YoungAdult
890    YoungAdult
Name: Cat_age, Length: 891, dtype: object

**SibSp, Parch 전처리**

In [ ]:
titanic_df['Family'] = titanic_df['SibSp']+titanic_df['Parch']

**Fare 전처리**

In [ ]:
titanic_df['Fare']

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: Fare, Length: 891, dtype: float64

In [ ]:
titanic_df['pre_Fare'] = pd.cut(titanic_df['Fare'],5)
titanic_df['pre_Fare']

0      (-0.512, 102.466]
1      (-0.512, 102.466]
2      (-0.512, 102.466]
3      (-0.512, 102.466]
4      (-0.512, 102.466]
             ...
886    (-0.512, 102.466]
887    (-0.512, 102.466]
888    (-0.512, 102.466]
889    (-0.512, 102.466]
890    (-0.512, 102.466]
Name: pre_Fare, Length: 891, dtype: category
Categories (5, interval[float64]): [(-0.512, 102.466] < (102.466, 204.932] < (204.932, 307.398] <
                                    (307.398, 409.863] < (409.863, 512.329]]

**Cabin 전처리**

In [ ]:
titanic_df['pre_Cabin'] = titanic_df['Cabin'].str[:1]
titanic_df['pre_Cabin']

0      N
1      C
2      N
3      C
4      N
      ..
886    N
887    B
888    N
889    C
890    N
Name: pre_Cabin, Length: 891, dtype: object

**Embarked 전처리**

In [ ]:
titanic_df['Embarked'].value_counts()

S    644
C    168
Q     77
N      2
Name: Embarked, dtype: int64

In [ ]:
titanic_df['pre_Embarked'] = titanic_df['Embarked'].str.replace('N','S')

In [ ]:
titanic_df['pre_Embarked'].value_counts()

S    646
C    168
Q     77
Name: pre_Embarked, dtype: int64

In [ ]:
titanic_df

     PassengerId  Survived  Pclass  ...           pre_Fare pre_Cabin  pre_Embarked
0              1         0       3  ...  (-0.512, 102.466]         N             S
1              2         1       1  ...  (-0.512, 102.466]         C             C
2              3         1       3  ...  (-0.512, 102.466]         N             S
3              4         1       1  ...  (-0.512, 102.466]         C             S
4              5         0       3  ...  (-0.512, 102.466]         N             S
..           ...       ...     ...  ...                ...       ...           ...
886          887         0       2  ...  (-0.512, 102.466]         N             S
887          888         1       1  ...  (-0.512, 102.466]         B             S
888          889         0       3  ...  (-0.512, 102.466]         N             S
889          890         1       1  ...  (-0.512, 102.466]         C             C
890          891         0       3  ...  (-0.512, 102.466]         N             Q

[891 rows x 18 columns]

In [ ]:
drop_list = ['PassengerId','Name','Age','Ticket','Fare','Cabin','Embarked']
titanic_df.drop(drop_list,axis = 1, inplace = True)

In [ ]:
titanic_df

     Survived  Pclass     Sex  ...           pre_Fare  pre_Cabin pre_Embarked
0           0       3    male  ...  (-0.512, 102.466]          N            S
1           1       1  female  ...  (-0.512, 102.466]          C            C
2           1       3  female  ...  (-0.512, 102.466]          N            S
3           1       1  female  ...  (-0.512, 102.466]          C            S
4           0       3    male  ...  (-0.512, 102.466]          N            S
..        ...     ...     ...  ...                ...        ...          ...
886         0       2    male  ...  (-0.512, 102.466]          N            S
887         1       1  female  ...  (-0.512, 102.466]          B            S
888         0       3  female  ...  (-0.512, 102.466]          N            S
889         1       1    male  ...  (-0.512, 102.466]          C            C
890         0       3    male  ...  (-0.512, 102.466]          N            Q

[891 rows x 11 columns]

In [ ]:
titanic_df.columns

Index(['Survived', 'Pclass', 'Sex', 'SibSp', 'Parch', 'pre_Name', 'Cat_age',
       'Family', 'pre_Fare', 'pre_Cabin', 'pre_Embarked'],
      dtype='object')

**레이블 인코딩**

In [ ]:
from sklearn.preprocessing import LabelEncoder

encoder = LabelEncoder()
for col in titanic_df.columns:
  if titanic_df[col].dtypes != 'int64':
    encoder.fit(titanic_df[col])
    titanic_df[col] = encoder.transform(titanic_df[col])

In [ ]:
titanic_df

     Survived  Pclass  Sex  SibSp  ...  Family  pre_Fare  pre_Cabin  pre_Embarked
0           0       3    1      1  ...       1         0          7             2
1           1       1    0      1  ...       1         0          2             0
2           1       3    0      0  ...       0         0          7             2
3           1       1    0      1  ...       1         0          2             2
4           0       3    1      0  ...       0         0          7             2
..        ...     ...  ...    ...  ...     ...       ...        ...           ...
886         0       2    1      0  ...       0         0          7             2
887         1       1    0      0  ...       0         0          1             2
888         0       3    0      1  ...       3         0          7             2
889         1       1    1      0  ...       0         0          2             0
890         0       3    1      0  ...       0         0          7             1

[891 rows x 11 columns]

In [ ]:
from sklearn.preprocessing import OneHotEncoder

In [ ]:
X_titanic_df = titanic_df.drop('Survived',axis = 1)
y_titanic_df = titanic_df['Survived']

In [ ]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score
from sklearn.model_selection import train_test_split

X_train,X_test,y_train,y_test = train_test_split(X_titanic_df,y_titanic_df,test_size = 0.2, random_state = 11)

dt_clf = DecisionTreeClassifier(random_state = 11)
rt_clf = RandomForestClassifier(random_state = 11)
lr_clf = LogisticRegression()

dt_clf.fit(X_train,y_train)
dt_pred = dt_clf.predict(X_test)
dt_acc = accuracy_score(y_test,dt_pred)
print('DecisionTreeClassifier 정확도 :',dt_acc)

rt_clf.fit(X_train,y_train)
rt_pred = rt_clf.predict(X_test)
rt_acc = accuracy_score(y_test,rt_pred)
print('RandomForestClassion 정확도 :',rt_acc)

lr_clf.fit(X_train,y_train)
pred = lr_clf.predict(X_test)
print('LogisticRegression 정확도 :{0:4f}'.format(accuracy_score(y_test,pred)))

DecisionTreeClassifier 정확도 : 0.8212290502793296
RandomForestClassion 정확도 : 0.8715083798882681
LogisticRegression 정확도 :0.854749

In [ ]:
import numpy as np
from sklearn.model_selection import KFold

def exec_kfold(clf,folds=5):
  kfold = KFold(n_splits = folds)
  scores = []
  for iter_count, (train_index,test_index) in enumerate(kfold.split(X_titanic_df)):
    X_train,X_test = X_titanic_df.values[train_index],X_titanic_df.values[test_index]
    y_train,y_test = y_titanic_df.values[train_index],y_titanic_df.values[test_index]
    clf.fit(X_train,y_train)
    predictions = clf.predict(X_test)
    accuracy = accuracy_score(y_test, predictions)
    scores.append(accuracy)
    print('교차 검증 {0} 정확도:{1:4f}'.format(iter_count,accuracy))
  mean_score = np.mean(accuracy)
  print('평균 검증 정확도:{0:4f}'.format(mean_score))

exec_kfold(dt_clf,folds=5)

교차 검증 0 정확도:0.765363
교차 검증 1 정확도:0.752809
교차 검증 2 정확도:0.792135
교차 검증 3 정확도:0.769663
교차 검증 4 정확도:0.814607
평균 검증 정확도:0.814607

In [ ]:
from sklearn.model_selection import cross_val_score

scores = cross_val_score(dt_clf, X_titanic_df, y_titanic_df, cv=5)
for iter_count, accuracy in enumerate(scores):
  print('교차 검증 {0} 정확도: {1:4f}'.format(iter_count,accuracy))

print('평균 검증 정확도',np.mean(scores))

교차 검증 0 정확도: 0.754190
교차 검증 1 정확도: 0.764045
교차 검증 2 정확도: 0.780899
교차 검증 3 정확도: 0.775281
교차 검증 4 정확도: 0.825843
평균 검증 정확도 0.780051471972883

In [ ]:
from sklearn.model_selection import GridSearchCV

parameters = {'max_depth':[2,3,5,10],'min_samples_split':[2,3,5],'min_samples_leaf':[1,5,8]}

grid_dclf = GridSearchCV(dt_clf,param_grid=parameters, scoring='accuracy',cv=5)
grid_dclf.fit(X_train,y_train)

print('GridSearchCV 최적 하이퍼 파라미터:',grid_dclf.best_params_)
print('GridSearchCV 최고 정확도 {0:4f}:'.format(grid_dclf.best_score_))
best_dclf = grid_dclf.best_estimator_

dprediction = best_dclf.predict(X_test)
accuracy = accuracy_score(y_test,dprediction)
print('테스트 세트에서 최고 정확도 {0:4f}'.format(accuracy))

GridSearchCV 최적 하이퍼 파라미터: {'max_depth': 5, 'min_samples_leaf': 1, 'min_samples_split': 3}
GridSearchCV 최고 정확도 0.803378:
테스트 세트에서 최고 정확도 0.877095